app/views/profiles/index.html.erb

      <td><%= @profile.bio %></td>
      <% @profile.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."profile_id" = ?  [["profile_id", 1]]