app/controllers/profiles_controller.rb

  def index
    @profile = Profile.last
---
SELECT  "profiles".* FROM "profiles" ORDER BY "profiles"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @profile = Profile.new(profile_params)


    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("name", "email", "github", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fellipe"], ["email", "Callegas.f@gmail.com"], ["github", "Callegas"], ["bio", "Eu mesmo"], ["created_at", 2016-09-14 17:55:16 UTC], ["updated_at", 2016-09-14 17:55:16 UTC]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["bio", "Eu mesmo 1"], ["updated_at", 2016-09-15 16:14:54 UTC], ["id", 1]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 4]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]