app/controllers/skills_controller.rb

  def index
    @skill = Skill.first
---
SELECT  "skills".* FROM "skills" ORDER BY "skills"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save
---
INSERT INTO "skills" ("name", "years", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Roberto"], ["years", 2], ["created_at", 2016-09-14 17:37:55 UTC], ["updated_at", 2016-09-14 17:37:55 UTC]]

  def destroy
    @skill.destroy
---
DELETE FROM "skills" WHERE "skills"."id" = ?  [["id", 1]]

    def set_skill
      @skill = Skill.find(params[:id])
---
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]